// like関数の定義
    function like (){
        const likeBtn = document.getElementById("like_btn")
        const likes = document.getElementById("likes")
        // 詳細ページ以外なら､以降の処理を起こさない //
            if (!likeBtn) {
                return false
            }
        /////////////////////////////////////////
        // いいね!ボタンをクリックした時の処理////////////////////////////////
            likeBtn.addEventListener("click", () => {
                // いいね!ボタンの色で条件分岐 (白の場合︰いいね!を付けてDBへ追加)///////////////////////
                    if (likeBtn.style.backgroundColor == "white") {
                        // クリックした時にボタンの色を変化させる/////////////
                            likeBtn.style.backgroundColor = "red"
                        /////////////////////////////////////////////////
                        // 現在のパスの情報から､数字情報を抽出する////////////////////
                        const postId = window.location.pathname.match(/\d+/)
                        ////////////////////////////////////////////////////////
                        // リクエストを送信する////////////////////////////////////
                            const XHR = new XMLHttpRequest();
                            XHR.open("POST", `/like?id=${postId}`, true)
                            XHR.responseType = "json"
                            XHR.send()
                        ////////////////////////////////////////////////////////
                        // レスポンスを受け取った後の処理 (いいね！の数をDBと対応させる)//////////////
                            XHR.onload = () => {
                                if (XHR.response) {
                                    likes.innerHTML = `
                                        <a href= "/posts/${XHR.response.id}/like_lists">
                                            ${XHR.response.count}
                                        </a>
                                        人が いいね！ しています｡
                                    `
                                } 
                            }
                        /////////////////////////////////////////////////////////////////////
                    }
                ///////////////////////////////////////////////////////////////////////////////
                // いいね!ボタンの色で条件分岐 (赤の場合︰いいね!をDBから削除)///////////////////
                    else {
                        // クリックした時にボタンの色を変化させる //////////////////////////           
                            likeBtn.style.backgroundColor = "white"
                        /////////////////////////////////////////////////////////////
                        // 現在のパスの情報から､数字情報を抽出する/////////////////////////       
                            const postId = window.location.pathname.match(/\d+/)   
                        ////////////////////////////////////////////////////////////
                        // リクエストを送信する////////////////////////////////////////
                            const XHR = new XMLHttpRequest();
                            XHR.open("POST", `/like_cancel?id=${postId}`, true)
                            XHR.responseType = "json"
                            XHR.send()
                        /////////////////////////////////////////////////////////////
                        // レスポンスを受け取った後の処理 (いいね！の数をDBと対応させる)//////
                            XHR.onload = () => {
                                if (XHR.response) {
                                    likes.innerHTML = `
                                        <a href= "/posts/${XHR.response.id}/like_lists">
                                            ${XHR.response.count}
                                        </a>
                                        人が いいね！ しています｡
                                    `
                                } 
                            }
                        //////////////////////////////////////////////////////////////
                    }
                //////////////////////////////////////////////////////////////////////////////
            })
        ////////////////////////////////////////////////////////////////////////////////////////
    }
  ///////////////////////////////////////////////////////////////////////////////////////////////////////////  
  // ページが読み込まれたら､like関数の処理を実行する////////////////////////////////////////////////////////////////
  window.addEventListener('load', like);